sim/v9a/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "3e-18/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    cyclic_1
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          6400;
        startFace       1498104;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclic_2;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    cyclic_2
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          6400;
        startFace       1504504;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyclic_1;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    air
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19986;
        startFace       1510904;
    }
    blade
    {
        type            wall;
        inGroups        1(wall);
        nFaces          29315;
        startFace       1530890;
    }
)

// ************************************************************************* //
